#+TITLE: Thesis Structure
#+AUTHOR: Tigany Zarrouk

* Statement of the Problem

  I do think that an underlying theme in your thesis can be what can and
  cannot be rendered in TB in the plasticity of transition metals with and
  without interstitials. And you can discuss how good (or rather bad) EAM
  is, especially with interstitials. You may also be sceptical of the DFT,
  especially in view of the difficulty with cell size and boundary
  conditions. And not forgetting that the French school's theory of jerky
  glice in Ti is based on a calculation of core energy difference that is
  within the error limits.

* Introduction: Literature Review
** Summary of Thesis
* Simulation Methodology
** Tight-binding

   - Explain tight-binding, from the perspective of maybe density
     functional theory / Horsfield [[file:papers/Horsfield_Smutna_Fogarty_fitting_TB_potentials_from_DFT_PhysRevMaterials.4.043801.pdf][Horsfield-Smutna-Fitting-TB]]

*** TODO Read Majeski & Vogel [[file:~/Documents/books/The%20Structures%20of%20Binary%20Compounds%20by%20J.%20Hafner,%20F.%20Hulliger,%20W.B.%20Jensen,%20J.A.%20Majewski,%20K.%20Mathis,%20P.%20Villars%20and%20P.%20Vogl%20(Eds.)%20(z-lib.org).pdf][Structures of binary compounds chapter 4]]
    DEADLINE: <2021-02-15 Mon>
    :PROPERTIES:
    :ORDERED:  t
    :END:

**** TODO Make notes of Majeski/Vogel
**** TODO Relate to DFT

 

*** TODO Read Horsfield-Smutna  [[file:papers/Horsfield_Smutna_Fogarty_fitting_TB_potentials_from_DFT_PhysRevMaterials.4.043801.pdf][Horsfield-Smutna-Fitting-TB]]
    DEADLINE: <2021-02-19 Fri>

*** TODO Read Heine 1980 [[file:papers/Electronic_Structure_from_the_Point_of_View_of_the_Local_Atomic_Environment_Heine_1980.pdf][Heine Local atomic structure]]
    SCHEDULED: <2021-02-04 Thu 17:00> DEADLINE: <2021-02-05 Fri>

       

*** TODO Summarise the theory - Consolidate here
    DEADLINE: <2021-03-05 Fri>

   

** BOP
** Embedding
** Fitting
*** HOLD Explain why I chose to fit this way :HOLD:
    - State "HOLD"       from "HOLD"       [2020-09-01 Tue 21:32] \\
      Use theory e.g. discontinity of inverse Slater Koster in Bond
      Integrals. Waiting for writing.
    - Explain algorithms 
    - Regularization - Elastic Net
      - What's the benefit? 
    - How could I have made it better if it failed. 
    - Martin cite:Martin2004, states that 
      - A /small/ basis of /orthogonal/ functions /must/ be long-ranged and
	environmentally-dependent to be accurate.
      - Whereas non-orthogonal functions can describe the system will with
        short-ranged atomic range functions, independent of environmental
        dependence.
    - In essence, this must mean I should argue against transferability? We know
      that people make a load of tight-binding models and never use them.
    - Our use case is the fact we can do embedding with this, so we do not mind
      about /absolute/ transferability. We just want to predict the correct
      quantities relevant to our problem of defects in titanium.
    - Even without this currently we have failed to find a model. Perhaps
      non-orthogonality/environmental dependence is necessary to describe the
      model
    - Perhaps, using the BOP code, one can put in environment dependent terms
      and see if the dissociation distance changes, but this is quite a large
      ask in the timeframe

*** TODO Finalize model for fitting
    DEADLINE: <2021-02-05 Fri>

** Remarks on tight-binding

   - Love it / Loathe it
   - Remark how with tight-binding we can see the different
     contributions to the total energy.
   - P. W. Anderson's theory on tight-binding. Dismissing it
     initially, but it's the right way to think about solids

* Dislocations in pure metals
** Fe

   - Comparison of the:
     - sd, non-orthogonal tight-binding models.
     - d-canonical model

*** DONE Peierls Potential
*** DONE Plot d/sd peierls potential - How does non-O/sd change?
    DEADLINE: <2020-09-04 Fri>
    :PROPERTIES:
    :ORDERED:  t
    :END:
    - State "DONE"       from "WAITING"    [2020-09-04 Fri 14:01]
    - State "WAITING"    from "TODO"       [2020-09-02 Wed 10:18] \\
      Waiting for the simulations to finish
    :LOGBOOK:
    CLOCK: [2020-09-04 Fri 12:00]--[2020-09-04 Fri 14:01] =>  2:01
    CLOCK: [2020-09-01 Tue 15:37]--[2020-09-01 Tue 21:10] =>  5:33
    :END:

    - Not much difference between the canonical-d band model and the sd
      model. The difference is surely within the error of convergence for these
      calculations.  

** Ti
*** TODO Energy dependence and core energy
    DEADLINE: <2021-02-26 Fri>

**** Think about why a d-canonical model would lead to large spreading? :NOTE:
     :LOGBOOK:
     CLOCK: [2020-09-02 Wed 10:46]--[2020-09-02 Wed 10:46] =>  0:00
     :END:
   [2020-09-02 Wed 10:46]
   [[file:~/Documents/docs/Management/org/refile.org::*Check Ti Models][Check Ti Models]]

*** TODO Core Energy difference in tbe - bop
    DEADLINE: <2021-02-12 Fri>

    - Tiny difference of 0.53 eV which determines the difference
      between each of the core energies.

*** TODO Calculate gamma surfaces for new model
    DEADLINE: <2021-02-26 Fri>

    - Planar faults 
      - Compare to DFT literature of Rodney, Curtin and Tarrat
      - Compare to other TB models
	- ICAMS model is rubbish!

*** Notes

    How does the orthogonal and canonical d-band model come into
    dislocation core structure. 

*** HOLD Are s-orbitals a necessary inclusion for dislocation mechanics? :HOLD:
    - State "HOLD"       from "WAITING"    [2020-09-03 Thu 12:46]

      - Why would they be necessary in the description?

      - Bonding-wise, why would they be necessary? Hybridisation?

*** HOLD How does overlap and non-orthogonality play a role?

    - In Trinkle's NOTB model and Hennig's MEAM, the dissociation distance is
      small.
    - NOTB includes overlap and s-orbitals.
    - MEAM includes an angular dependence which varies with the density
      - This models the effects of bond bending.
      - Lenosky et al. modified the original MEAM potential by using cubic
        splines for the functional form. This removes the constraint of fixed
        angular char- acter and allows for additional flexibility of the
        potential. cite:hennig08_class_poten_descr_marten_phase

*** WAITING Checking that self-consistency doesn't change the dissociation distance :WAITING:
    - State "WAITING"    from "HOLD"       [2020-09-03 Thu 15:47] \\
      Waiting for mag calculation to finish

* Oxygen in Ti

  - TB >> DFT!
    - Because we can decompose the total energy into contributions
    - Look at how tight-binding allows us to see the physics by
      breaking down the total energy.

** TODO Defect clusters
   DEADLINE: <2021-03-26 Fri>

** TODO Binding of oxygen to dislocations if possible
   DEADLINE: <2021-03-05 Fri>

*** TODO Repulsive energy of oxygen
    DEADLINE: <2021-03-05 Fri>

*** DONE [#A] Implement Partial occupancy line tension model
    SCHEDULED: <2021-01-28 Thu 09:30> DEADLINE: <2021-01-28 Thu>
    :PROPERTIES:
    :ORDERED:  t
    :END:
    :LOGBOOK:
    CLOCK: [2021-01-28 Thu 17:03]--[2021-01-28 Thu 17:28] =>  0:25
    CLOCK: [2021-01-28 Thu 16:37]--[2021-01-28 Thu 17:02] =>  0:25
    CLOCK: [2021-01-28 Thu 15:49]--[2021-01-28 Thu 16:14] =>  0:25
    CLOCK: [2021-01-28 Thu 14:11]--[2021-01-28 Thu 14:36] =>  0:25
    CLOCK: [2021-01-28 Thu 11:39]--[2021-01-28 Thu 12:04] =>  0:25
    CLOCK: [2021-01-28 Thu 10:59]--[2021-01-28 Thu 11:24] =>  0:25
    CLOCK: [2021-01-28 Thu 10:11]--[2021-01-28 Thu 10:36] =>  0:25
    CLOCK: [2021-01-27 Wed 17:01]--[2021-01-27 Wed 17:26] =>  0:25
    CLOCK: [2021-01-27 Wed 16:18]--[2021-01-27 Wed 16:43] =>  0:25
    CLOCK: [2021-01-27 Wed 15:33]--[2021-01-27 Wed 15:48] =>  0:15
    CLOCK: [2021-01-27 Wed 15:23]--[2021-01-27 Wed 15:32] =>  0:09
    CLOCK: [2021-01-27 Wed 11:29]--[2021-01-27 Wed 11:54] =>  0:25
    CLOCK: [2021-01-27 Wed 10:57]--[2021-01-27 Wed 11:22] =>  0:25
    CLOCK: [2021-01-27 Wed 10:19]--[2021-01-27 Wed 10:44] =>  0:25
    CLOCK: [2021-01-27 Wed 09:46]--[2021-01-27 Wed 10:11] =>  0:25
    CLOCK: [2021-01-26 Tue 13:21]--[2021-01-26 Tue 13:44] =>  0:23
    CLOCK: [2021-01-26 Tue 13:20]--[2021-01-26 Tue 13:21] =>  0:01
    CLOCK: [2021-01-26 Tue 13:19]--[2021-01-26 Tue 13:20] =>  0:01
    CLOCK: [2021-01-26 Tue 11:32]--[2021-01-26 Tue 11:57] =>  0:25
    CLOCK: [2021-01-26 Tue 11:02]--[2021-01-26 Tue 11:27] =>  0:25
    CLOCK: [2021-01-26 Tue 10:16]--[2021-01-26 Tue 10:41] =>  0:25
    CLOCK: [2021-01-26 Tue 09:39]--[2021-01-26 Tue 10:00] =>  0:21
    CLOCK: [2021-01-26 Tue 09:39]--[2021-01-26 Tue 09:39] =>  0:00
    CLOCK: [2021-01-26 Tue 09:38]--[2021-01-26 Tue 09:38] =>  0:00
    CLOCK: [2021-01-26 Tue 09:36]--[2021-01-26 Tue 09:36] =>  0:00
    CLOCK: [2021-01-26 Tue 09:35]--[2021-01-26 Tue 09:36] =>  0:01
    CLOCK: [2021-01-11 Mon 16:51]--[2021-01-11 Mon 17:16] =>  0:25
    CLOCK: [2021-01-11 Mon 16:21]--[2021-01-11 Mon 16:46] =>  0:25
    CLOCK: [2021-01-11 Mon 14:36]--[2021-01-11 Mon 14:55] =>  0:19
    CLOCK: [2021-01-11 Mon 14:30]--[2021-01-11 Mon 14:35] =>  0:05
    CLOCK: [2021-01-11 Mon 14:30]--[2021-01-11 Mon 14:30] =>  0:00
    CLOCK: [2021-01-11 Mon 10:46]--[2021-01-11 Mon 10:55] =>  0:09
    CLOCK: [2021-01-11 Mon 10:30]--[2021-01-11 Mon 10:45] =>  0:15
    :END:


**** TODO Actions [6/6]
    - [X] Do I just include carbon along the whole dislocation line?
      Talk to Ivo perhaps about teams and the like

    - [X] Implement the Maxwell-Boltzmann statistics for the concentration.

    - [X]  Include initial summation of concentrations along [5/5]
      dislocation line.
      - [X] Constrain total concentration
      - [X] Make new file which controls the addition of concentration
        dependence along the dislocation line
      - [X] Define trap sites for an image:
	- These are ones which reside in the plane of the dislocation.
	- The solute redistributes in each plane only.
	- Does the occupation probability does not "spill over" into
          other segments.
	- Are these just the usual octahedral sites within the line?
	- What is the redistribution?
	  * I assume the redistribution is just the change in
            concentration from the dislocation moving, so the trap
            site is in another relative position, therefore the
            concentration of that particular site is less (think of
            the spline distance dependence).
	  * As its intra-planar, then the trap sites depend on the 2d
            distance from the core position. We know the octahedral
            positions thankfully.
	- We could include the effects of the other sites further from
          the dislocation also. It would complicate the implementation
          though, as mappings aren't unique: how can one smoothly
          transition a site when the hard core does not have a similar
          distribution of trap sites to the easy core?
	- Ivo chooses this latter description, with some reasonable
          (albeit wrong) assumptions.
	- Each core should have all the trap sites from molecular
          statics described, but then their action should be scaled by
          the number of sites which "decay" to that position.
      - [X] Describe paths along the transition between easy and hard
        core.
      - [X] Figure out how to circumvent the trap site problem
	- From easy to hard there is different mappings of sites.
	- Need mapping of all sites such that it is symmetric.
	- Can include all sites, but then there is a difference in the
          range of interactions which are included in the x direction
          (more than the y direction).
	- *Fixed*:
	  - Will find the many-to-one mappings and
            multiplicatively scale each of the interactions based on the
            distance from the initial easy core site.
	  - Isolated sites will be multiplicatively scaled to zero by
            the same process.
	  - This multiplicative action will also modify the energies
            in the same way.

    - Follow the notes on Ivo's paper [[file:roam/gonginfluencehydrogenplasticity2020.org::#gongInfluenceHydrogenPlasticity2020][The influence of hydrogen on plasticity in pure iron—theory and experiment]]
    - [X] Why are the dependences not changing with concentration?
       They are.
    - [X] Check that the full temperature dependent concentrations
       are giving sensible results.
    - [X] Solve why Spline is giving zeros for concentration at any distance


**** Notes
    - Making a function such that at a given distance of a solute one
      can get the McClean isotherm concentration.
    - Input: distance, Output: concentration
    - The data fed into the system are the energies from the lorentzian
      at different distances. These act at formation energies in the
      equations for the solution of the McClean isotherm.

   
** TODO Embedding Calculations
   SCHEDULED: <2021-02-08 Mon 10:00> DEADLINE: <2021-03-20 Sat>

*** TODO Just look at vacancies and oxygen?
*** TODO Other Dislocation structures if models don't work?
** Surface Energies?
* Embedding
* Carbon in Fe

  - SKF report 
  - Onwards to kMC

** DONE Carbon binding to dislocations
** TODO Energy dependence with radius - Add data
   DEADLINE: <2021-02-12 Fri>

** DONE Concentration Analysis - Add in repulsive energy
   DEADLINE: <2020-09-25 Fri>

** DONE Line Tension Model
*** DONE Derive line tension equations
    DEADLINE: <2020-09-25 Fri>
    :LOGBOOK:
    CLOCK: [2020-09-15 Tue 11:00]--[2020-09-16 Wed 11:39] => 24:39
    CLOCK: [2020-09-08 Tue 10:25]--[2020-09-08 Tue 11:52] =>  1:27
    :END:

*** DONE Use simple models
    DEADLINE: <2021-01-22 Fri>

    - Sine-Gordon
    - Others as found in Caillard [[file:~/Documents/books/Thermally%20Activated%20Mechanisms%20in%20Crystal%20Plasticity%20by%20D.%20Caillard%20and%20J.L.%20Martin%20(Eds.)%20(z-lib.org)%20(1).pdf][Thermally activated mechanisms in crystal plasticity]]

*** DONE Verify Itakura results with impelementation
    DEADLINE: <2020-10-16 Fri>

*** DONE Look at what we get from d/sd Iron models
    DEADLINE: <2020-11-06 Fri>

* Line Tension modelling
* Wish-list

  - Line tension models maybe? 

